//«адание 1.
//Ќапишите программу, котора€ поочерЄдно запрашивает у пользовател€ переменные различных типов, 
//после чего выводит их все через пробел обратно в консоль. 
//ќб€зательно использовать такие типы данных как int, double, char, bool, string. 
//“о есть, например, программа просит пользовател€ УEnter int: У, затем УEnter double: У и так далее, 
//а в конце выводит УYou entered: 5 3.14 random_string У и так далее.

#include <iostream>

using namespace std;

int main{

cout << "Hello!!";

}